In [2]:
import pandas as pd
import numpy as np

In [3]:
obj = pd.Series([4, 7, -5, 3])

obj

0    4
1    7
2   -5
3    3
dtype: int64

In [4]:
obj.values

array([ 4,  7, -5,  3], dtype=int64)

In [5]:
obj.index

RangeIndex(start=0, stop=4, step=1)

In [8]:
obj2 = pd.Series([4, 7, -5, 3], index = ['d','b','a','c'])
obj2

d    4
b    7
a   -5
c    3
dtype: int64

In [10]:
obj2['a']

-5

In [11]:
obj2[obj2 > 0]

d    4
b    7
c    3
dtype: int64

In [12]:
obj3 = obj2 * 2
obj3

d     8
b    14
a   -10
c     6
dtype: int64

In [13]:
np.exp(obj2)

d      54.598150
b    1096.633158
a       0.006738
c      20.085537
dtype: float64

In [18]:
print('b' in obj3)
print('e' in obj3)

True
False

In [22]:
sdata = {'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah':5000}
obj4 = pd.Series(sdata)
obj4

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [23]:
states = ['California','Ohio','Oregon', 'Texas']
obj5 = pd.Series(sdata, index = states)
obj5

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [24]:
pd.isnull(obj5)

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [25]:
pd.notnull(obj5)

California    False
Ohio           True
Oregon         True
Texas          True
dtype: bool

In [26]:
obj5.isnull()

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [27]:
obj5.notnull()

California    False
Ohio           True
Oregon         True
Texas          True
dtype: bool

In [28]:
obj4+ obj5

California         NaN
Ohio           70000.0
Oregon         32000.0
Texas         142000.0
Utah               NaN
dtype: float64

In [29]:
obj5.name = 'popultaion'

obj5.index.name = 'state'

In [30]:
obj5

state
California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
Name: popultaion, dtype: float64

In [31]:
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [32]:
obj.index = ['Bob','Steve','Jeff','Ryan']
obj

Bob      4
Steve    7
Jeff    -5
Ryan     3
dtype: int64

In [35]:
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada',' Nevada', 'Nevada'],
       'year': [2000, 2001, 2002, 20201, 2002, 2003],
       'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}
frame = pd.DataFrame(data)

In [36]:
frame.head()

     state   year  pop
0     Ohio   2000  1.5
1     Ohio   2001  1.7
2     Ohio   2002  3.6
3   Nevada  20201  2.4
4   Nevada   2002  2.9

In [37]:
pd.DataFrame(data, columns=['year','state','pop'])

    year    state  pop
0   2000     Ohio  1.5
1   2001     Ohio  1.7
2   2002     Ohio  3.6
3  20201   Nevada  2.4
4   2002   Nevada  2.9
5   2003   Nevada  3.2

In [40]:
frame2 = pd.DataFrame(data, columns=['year','state','pop','debt'],
                     index = ['one','two','three','four','five','six'])

In [41]:
frame2

        year    state  pop debt
one     2000     Ohio  1.5  NaN
two     2001     Ohio  1.7  NaN
three   2002     Ohio  3.6  NaN
four   20201   Nevada  2.4  NaN
five    2002   Nevada  2.9  NaN
six     2003   Nevada  3.2  NaN

In [42]:
frame2['state']

one         Ohio
two         Ohio
three       Ohio
four      Nevada
five      Nevada
six       Nevada
Name: state, dtype: object

In [43]:
frame2.year

one       2000
two       2001
three     2002
four     20201
five      2002
six       2003
Name: year, dtype: int64

In [44]:
frame2.loc['three']

year     2002
state    Ohio
pop       3.6
debt      NaN
Name: three, dtype: object

In [45]:
frame2['debt'] =16.5

In [46]:
frame2

        year    state  pop  debt
one     2000     Ohio  1.5  16.5
two     2001     Ohio  1.7  16.5
three   2002     Ohio  3.6  16.5
four   20201   Nevada  2.4  16.5
five    2002   Nevada  2.9  16.5
six     2003   Nevada  3.2  16.5

In [48]:
frame2['debt'] = np.arange(6.)
frame2

        year    state  pop  debt
one     2000     Ohio  1.5   0.0
two     2001     Ohio  1.7   1.0
three   2002     Ohio  3.6   2.0
four   20201   Nevada  2.4   3.0
five    2002   Nevada  2.9   4.0
six     2003   Nevada  3.2   5.0

In [49]:
val = pd.Series([-1.2, -1.5, -1.7], index = ['two', 'four','five'])
frame2['debt'] = val
frame2

        year    state  pop  debt
one     2000     Ohio  1.5   NaN
two     2001     Ohio  1.7  -1.2
three   2002     Ohio  3.6   NaN
four   20201   Nevada  2.4  -1.5
five    2002   Nevada  2.9  -1.7
six     2003   Nevada  3.2   NaN

In [50]:
frame2['eastern'] = frame2.state == 'Ohio'

In [51]:
frame2

        year    state  pop  debt  eastern
one     2000     Ohio  1.5   NaN     True
two     2001     Ohio  1.7  -1.2     True
three   2002     Ohio  3.6   NaN     True
four   20201   Nevada  2.4  -1.5    False
five    2002   Nevada  2.9  -1.7    False
six     2003   Nevada  3.2   NaN    False

In [52]:
del frame2['eastern']

In [54]:
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [55]:
pop = {'Nevada': {2001: 2.4, 2002: 2.9},
      'Ohio': {2000: 1.5, 2001: 1.7, 2002: 3.6}}

frame3 = pd.DataFrame(pop)
frame3

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2000     NaN   1.5

In [56]:
#컬럼과 로우 위치 바꿈
frame3.T

        2001  2002  2000
Nevada   2.4   2.9   NaN
Ohio     1.7   3.6   1.5

In [57]:
pd.DataFrame(pop, index=[2001, 2002, 2003])

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2003     NaN   NaN

In [59]:
 pdata = {'Ohio': frame3['Ohio'][:-1],
         'Nevada': frame3['Nevada'][:2]}

pd.DataFrame(pdata)

      Ohio  Nevada
2001   1.7     2.4
2002   3.6     2.9

In [60]:
frame3.index.name = 'year'; frame3.columns.name = 'state'

In [61]:
frame3

state  Nevada  Ohio
year
2001      2.4   1.7
2002      2.9   3.6
2000      NaN   1.5

In [62]:
frame3.values

array([[2.4, 1.7],
       [2.9, 3.6],
       [nan, 1.5]])

In [63]:
frame2.values

array([[2000, 'Ohio', 1.5, nan],
       [2001, 'Ohio', 1.7, -1.2],
       [2002, 'Ohio', 3.6, nan],
       [20201, 'Nevada', 2.4, -1.5],
       [2002, ' Nevada', 2.9, -1.7],
       [2003, 'Nevada', 3.2, nan]], dtype=object)

### 색인 객체
- pandas의 색인 객체는 표 형식의 데이터에서 각 로우와 컬럼에 대한 이름과 다른 메타데이터(축의 이름 등)를 저장하는 객체다. series나 dataframe 객체를 생성할 때 사용되는 배열이나 다른 순차적인 이름은 내부적으로 색인으로 변환된다.

In [64]:
obj = pd.Series(range(3), index=['a','b','c'])

index = obj.index

index

Index(['a', 'b', 'c'], dtype='object')

In [65]:
index[1:]

Index(['b', 'c'], dtype='object')

In [66]:
labels = pd.Index(np.arange(3))

labels

Int64Index([0, 1, 2], dtype='int64')

In [67]:
obj2 = pd.Series([1.5, -2.5, 0], index=labels)

obj2

0    1.5
1   -2.5
2    0.0
dtype: float64

In [68]:
obj2.index is labels

True

In [69]:
frame3

state  Nevada  Ohio
year
2001      2.4   1.7
2002      2.9   3.6
2000      NaN   1.5

In [70]:
frame3.columns

Index(['Nevada', 'Ohio'], dtype='object', name='state')

In [71]:
'Ohio' in frame3.columns

True

In [72]:
2003 in frame3.index

False

In [73]:
#파이썬의 집합과는 달리 pandas의 인덱스는 중복되는 값을 허용한다.

dup_labels = pd.Index(['foo','foo','bar','bar'])

dup_labels

Index(['foo', 'foo', 'bar', 'bar'], dtype='object')

### pandas의 중요 기능

#### 재색인

pandas 객체의 중요한 기능 중 하나는 reindex인데, 새로운 색인에 맞도록 객체를 새로 생성한다.

In [76]:
obj = pd.Series(range(4), index=['d','b','a','c'])

In [77]:
obj

d    0
b    1
a    2
c    3
dtype: int64

In [79]:
obj2 = obj.reindex(['a','b','c','d','e'])
obj2

a    2.0
b    1.0
c    3.0
d    0.0
e    NaN
dtype: float64

In [80]:
# Series 객체에 대해 reindex를 호출하면 데이터를 새로운 색인에 맞게 재배열하고, 존재하지 않는 색인값이 있다면 NaN을 추가한다.

In [81]:
#시계열에서의 순차적인 데이터를 재색인 하는 방법

In [82]:
obj3 = pd.Series(['blue','purple','yellow'], index=[0, 2, 4])

obj3

0      blue
2    purple
4    yellow
dtype: object

In [83]:
obj3.reindex(range(6), method='ffill')

0      blue
1      blue
2    purple
3    purple
4    yellow
5    yellow
dtype: object

In [84]:
#DataFrame에 대한 reindex는 로우(index), column 또는 둘 다 변경이 가능하다.
#방법은 순서만 전달하면 로우가 reindex된다.

frame = pd.DataFrame(np.arange(9).reshape((3, 3)),
                    index=['a','c','d'],
                     columns=['Ohio','Texas','California'])
frame

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

In [85]:
frame2 = frame.reindex(['a','b','c','d'])
frame2

   Ohio  Texas  California
a   0.0    1.0         2.0
b   NaN    NaN         NaN
c   3.0    4.0         5.0
d   6.0    7.0         8.0

In [86]:
states = ['Texas','Utah','California']

frame.reindex(columns = states)

   Texas  Utah  California
a      1   NaN           2
c      4   NaN           5
d      7   NaN           8

### raw, column 삭제하는 방법

In [95]:
obj = pd.Series(np.arange(5.), index=['a','b','c','d','e'])
obj

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

In [96]:
new_obj = obj.drop('c')
new_obj

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

In [97]:
obj.drop(['d','c'])

a    0.0
b    1.0
e    4.0
dtype: float64

In [98]:
# DataFrame에서는 raw와 column 모두에서 값을 삭제할 수 있다.

data = pd.DataFrame(np.arange(16).reshape((4,4)),
                    index = ['Ohio','Colorado','Utah','New York'],
                    columns = ['onw','two','three','four'])

data

          onw  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [99]:
data.drop(['Colorado', 'Ohio'])

          onw  two  three  four
Utah        8    9     10    11
New York   12   13     14    15

In [100]:
# column 값 삭제 시에는 axis=1  or axis='columns'를 인자로 넘겨주면 된다.
data.drop('two', axis=1)

          onw  three  four
Ohio        0      2     3
Colorado    4      6     7
Utah        8     10    11
New York   12     14    15

In [101]:
data.drop(['two','four'],axis='columns')

          onw  three
Ohio        0      2
Colorado    4      6
Utah        8     10
New York   12     14

In [102]:
# drop함수처럼 Series나 DataFrame의 크기 또는 형태를 변경하는 함수는 새로운 객체를 반환하는 대신 원본 객체를 변경한다.

obj.drop('c', inplace=True)

In [103]:
obj

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

### 색인하기, 선택하기, 거르기

Series의 색인은 Numpy 배열의 색인과 유사하게 동작하지만 정수가 아니어도 된다는 점이 다르다

In [110]:
obj = pd.Series(np.arange(4.), index=['a','b','c','d'])
obj

a    0.0
b    1.0
c    2.0
d    3.0
dtype: float64

In [111]:
obj['b']

1.0

In [112]:
obj[1]

1.0

In [113]:
obj[2:4]

c    2.0
d    3.0
dtype: float64

In [114]:
obj[['b','a','d']]

b    1.0
a    0.0
d    3.0
dtype: float64

In [115]:
obj[[1, 3]]

b    1.0
d    3.0
dtype: float64

In [116]:
obj[obj <2]

a    0.0
b    1.0
dtype: float64

In [117]:
obj['b':'c']

b    1.0
c    2.0
dtype: float64

In [118]:
obj['b':'c'] = 5

In [119]:
obj

a    0.0
b    5.0
c    5.0
d    3.0
dtype: float64

In [120]:
# 색인으로 DataFrame에서 하나 이상의 column 값을 가져올 수 있다.

data = pd.DataFrame(np.arange(16).reshape((4, 4)),
                    index=['Ohio','Colorado','Utah','New York'],
                    columns=['one','two','three','four'])

data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [121]:
data['two']

Ohio         1
Colorado     5
Utah         9
New York    13
Name: two, dtype: int32

In [123]:
data[['three','one']]

          three  one
Ohio          2    0
Colorado      6    4
Utah         10    8
New York     14   12

In [124]:
data[:2]

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7

In [125]:
data[data['three']>5]

          one  two  three  four
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [126]:
data < 5

            one    two  three   four
Ohio       True   True   True   True
Colorado   True  False  False  False
Utah      False  False  False  False
New York  False  False  False  False

In [127]:
data[data < 5] = 0

In [128]:
data

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

### loc와 iloc으로 선택하는 방법
- DataFrame의 raw에 대해 label로 색인하는 방법으로 특수한 색인 필드인 loc과 iloc를 소개한다.
- 이 방법을 이용하면 Numpy와 비슷한 방식에 추가적으로 축의 label을 사용하여 DataFrame의 raw와 column을 선택할 수 있다.
- 축 이름을 선택할 때는 loc를, 정수 색인으로 선택할 때는 iloc를 사용한다.

In [129]:
data.loc['Colorado',['two','three']]

two      5
three    6
Name: Colorado, dtype: int32

In [130]:
data.iloc[2, [3,0,1]]

four    11
one      8
two      9
Name: Utah, dtype: int32

In [131]:
data.iloc[2]

one       8
two       9
three    10
four     11
Name: Utah, dtype: int32

In [132]:
data.iloc[[1, 2], [3, 0, 1]]

          four  one  two
Colorado     7    0    5
Utah        11    8    9

In [133]:
#loc, iloc는 슬라이스와 단일 라벨이나 라벨 리스트도 지원한다.
data.loc[:'Utah','two']

Ohio        0
Colorado    5
Utah        9
Name: two, dtype: int32

In [136]:
data.iloc[:, :3][data.three > 5]

          one  two  three
Colorado    0    5      6
Utah        8    9     10
New York   12   13     14

### 정수 색인
- 정수 색인으로 pandas 객체를 다루다보면 리스트나 튜플 같은 파이썬 내장 자료구조에서 색인을 다루는 방법과의 차이점 때문에 실수하게 되는 경우가 있다.
- 예를 들면 아래와 같은 코드가 에러를 발생할 것이라고 생각하지 않을 것이다.

In [137]:
ser = pd.Series(np.arange(3.))
ser
ser[-1]

KeyError: -1

In [138]:
ser

0    0.0
1    1.0
2    2.0
dtype: float64

In [142]:
#정수 기반의 색인을 사용하지 않는 경우 이런 모호함은 사라진다.
ser2 = pd.Series(np.arange(3.), index=['a','b','c'])
ser2[-1]

2.0

In [143]:
ser[:1]

0    0.0
dtype: float64

In [144]:
#좀 더 세밀하게 사용하고 싶다면 label에 대해서는 loc 정수에 대해서는 iloc를 사용하자
ser.loc[:2]

0    0.0
1    1.0
2    2.0
dtype: float64

In [145]:
ser.iloc[:2]

0    0.0
1    1.0
dtype: float64

### 산술 연산과 데이터 정렬
- pandas에서 가장 중요한 기능 중 하나는 다른 색인을 갖고 있는 객체 간의 산술 연산이다.
- 객체를 더할 때 짝이 맞지 않는 색인이 있다면 결과에 두 색인이 통합된다. 데이터베이스를 사용해본 경험이 있다면 색인 라벨에 대해 외부 조인과 유사하게 동작한다고 생각할 수 있다.

In [147]:
s1 = pd.Series(np.random.randn(4), index=['a','c','d','e'])


s2 = pd.Series(np.random.randn(5), index=['a','c','e','f','g'])

In [148]:
s1

a    0.951825
c    0.092373
d    0.577764
e   -0.766141
dtype: float64

In [149]:
s2

a    0.986061
c   -1.112919
e    0.664439
f   -2.221995
g    1.234376
dtype: float64

In [150]:
s1 + s2

a    1.937886
c   -1.020546
d         NaN
e   -0.101702
f         NaN
g         NaN
dtype: float64

In [151]:
#서로 겹치는 색인이 없는 경우 데이터는 NA 값이 된다.
# 산술 연산 시 누락된 값은 전파된다.
# DataFrame의 경우 정렬은 raw와 column 모두에 적용된다.
df1 = pd.DataFrame(np.arange(9.).reshape((3,3)), columns = list('bcd'),
                  index=['Ohio','Texas','Colorado'])

df2 = pd.DataFrame(np.arange(12.0).reshape((4,3)), columns = list('bde'),
                   index=['Utah','Ohio','Texas','Oregon'])

In [152]:
df1

            b    c    d
Ohio      0.0  1.0  2.0
Texas     3.0  4.0  5.0
Colorado  6.0  7.0  8.0

In [153]:
df2

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [154]:
df1 + df2

            b   c     d   e
Colorado  NaN NaN   NaN NaN
Ohio      3.0 NaN   6.0 NaN
Oregon    NaN NaN   NaN NaN
Texas     9.0 NaN  12.0 NaN
Utah      NaN NaN   NaN NaN

In [157]:
df1 = pd.DataFrame({'A': [1, 2]})
df2 = pd.DataFrame({'B': [3, 4]})

df1

   A
0  1
1  2

In [158]:
df2

   B
0  3
1  4

In [160]:
# 공통되는 column label이나 raw label이 없는 DataFrame을 더하면 결과에 아무것도 나타나지 않는다.
df1 - df2

    A   B
0 NaN NaN
1 NaN NaN

###  산술 연산 method에 채워 넣을 값 지정하는 방법
- 서로 다른 색인을 가지는 객체 간의 산술 연산에서 존재하지 않는 축의 값을 특수한 값(0 etc...)으로 지정하고 싶을 때는 다음과 같은 방법을 사용하면 된다

In [161]:
df1 = pd.DataFrame(np.arange(12.).reshape((3,4)),
                  columns=list('abcd'))

df2 = pd.DataFrame(np.arange(20.).reshape((4,5)),
                  columns = list('abcde'))

df2.loc[1, 'b'] = np.nan

df1

     a    b     c     d
0  0.0  1.0   2.0   3.0
1  4.0  5.0   6.0   7.0
2  8.0  9.0  10.0  11.0

In [162]:
df2

      a     b     c     d     e
0   0.0   1.0   2.0   3.0   4.0
1   5.0   NaN   7.0   8.0   9.0
2  10.0  11.0  12.0  13.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [163]:
# 겹치지 않는 부분은 NA 값이 된다.
df1 + df2

      a     b     c     d   e
0   0.0   2.0   4.0   6.0 NaN
1   9.0   NaN  13.0  15.0 NaN
2  18.0  20.0  22.0  24.0 NaN
3   NaN   NaN   NaN   NaN NaN

In [164]:
# df1에 add  method를 사용하고, df2와 fill_value 값을 인자로 전달한다.
df1.add(df2, fill_value= 0)

      a     b     c     d     e
0   0.0   2.0   4.0   6.0   4.0
1   9.0   5.0  13.0  15.0   9.0
2  18.0  20.0  22.0  24.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [165]:
# Series와 DataFrame의 산술 연산 method, 각각의 산술 연산 method는  r로 시작하는 계산 인자를 뒤지어 계산하는 method를 가진다.

1 / df1

       a         b         c         d
0    inf  1.000000  0.500000  0.333333
1  0.250  0.200000  0.166667  0.142857
2  0.125  0.111111  0.100000  0.090909

In [166]:
df1.rdiv(1)

       a         b         c         d
0    inf  1.000000  0.500000  0.333333
1  0.250  0.200000  0.166667  0.142857
2  0.125  0.111111  0.100000  0.090909

In [167]:
# Series나 DataFrame을 재색인 할 때도 fill_value를 지정할 수 있다.

df1.reindex(columns=df2.columns, fill_value = 0)

     a    b     c     d  e
0  0.0  1.0   2.0   3.0  0
1  4.0  5.0   6.0   7.0  0
2  8.0  9.0  10.0  11.0  0